package org.opentutorials.javatutorials.array;

public class DefineDemo {

	public static void main(String[] args) {
		
		// 배열이란 > 연관된 데이터를 모아서 관리하기 위해 사용하는 "데이터 타입"

		String[] classGroup = { "최진혁", "최유빈", "한이람", "이고잉" };	
		
		// A라는 변수에 여러개의 데이터를 담아야 할 때가 생긴다
		//연관된 데이터를 하나의 변수에 담아 쉽게 관리할 수 있게 만든 도구
		
		//반장:최진혁 부반장:최유빈
		//반에 여러명의 학생이 있다고 치고 특정한 학생에게 반장이라는 타이틀을 준다
		//선생님이 누가 반장인지 몰라도 반장을 부르면 온다
		//다른학생이 반장이 되어도 반장을 부르면 새로운 반장이된 학생이 선생님께 간다
		//학생= 상수(데이터) 반장=특정한 이름을 붙힌 일종의 "변수"
		
		//필요에 따라 그룹핑
		//학생을 데이터라고 했을때 관리하기 용이하게 
		//학년 반 등에 따라 나눠 관리한다고 생각하면 된다
		
		
	}

}
